app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Hey"], ["description", "What's up"], ["name", "Shimran\r\n"], ["created_at", "2015-03-27 22:35:25.346698"], ["updated_at", "2015-03-27 22:35:25.346698"]]
---
  def create
    @posts = Post.new(post_params)
    if @posts.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 3]]
---
  def edit
    @posts = Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
---
  def destroy
    @posts = Post.find(params[:id])
    @posts.destroy

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @posts = Post.find(params[:id])